app/views/dashboards/index.html.erb

SELECT "dashboards".* FROM "dashboards"
SELECT COUNT(*) FROM "dashboard_widgets" WHERE "dashboard_widgets"."dashboard_id" = 1
---
              <div class="dashboard-stat">
                <div class="dashboard-stat-value"><%= dashboard.dashboard_widgets.count %></div>