app/views/dashboards/show.html.erb

SELECT 1 AS one FROM "dashboard_widgets" WHERE "dashboard_widgets"."dashboard_id" = 1 LIMIT 1
---

    <% if @dashboard.dashboard_widgets.empty? %>

SELECT "dashboard_widgets".* FROM "dashboard_widgets" WHERE "dashboard_widgets"."dashboard_id" = 1 ORDER BY "dashboard_widgets"."position_y" ASC, "dashboard_widgets"."position_x" ASC
---
         style="--columns: <%= @dashboard.columns || 3 %>;">
      <% @dashboard.dashboard_widgets.includes(:widget).order(:position_y, :position_x).each do |dashboard_widget| %>

SELECT 1 AS one FROM "dashboard_user_roles" WHERE "dashboard_user_roles"."dashboard_id" = 1 LIMIT 1
---
      <div class="slideover-body">
        <% if @dashboard.dashboard_user_roles.any? %>