app/services/data_sources/manager_service.rb

INSERT INTO "data_sources" ("config", "created_at", "creator_id", "is_public", "name", "source_type", "updated_at") VALUES ('{"url":"https://httpbin.org/basic-auth/user/passwd","method":"get","headers":{},"query_params":{},"timeout":30,"interval":300,"auth":{"username":"user","password":"passwd"}}', '2025-12-22 17:56:41.586633', 1, FALSE, 'Test JSON API - mit Basic Auth', 0, '2025-12-22 17:56:41.586633') RETURNING "id"
---
    def create_and_subscribe(creator:, name:, source_type:, config:, is_public: false, auto_subscribe: true)
      # Konvertiere Config-Objekt zu Hash wenn nötig
      config_hash = config.is_a?(Configs::Base) ? config.to_h : config

      @data_source = DataSource.create!(
        creator: creator,
        name: name,
        source_type: source_type,
        config: config_hash,
        is_public: is_public
      )