app/controllers/dashboards_controller.rb

  def index
    @dashboards = Dashboard.all
---
SELECT "dashboards".* FROM "dashboards"

  def create
    @dashboard = Dashboard.new(dashboard_params)

    respond_to do |format|
      if @dashboard.save
---
INSERT INTO "dashboards" ("columns", "created_at", "icon", "is_public", "name", "updated_at") VALUES (3, '2026-01-05 11:48:28.507373', '📊', FALSE, 'Test Dashboard 1', '2026-01-05 11:48:28.507373') RETURNING "id"

  def update
    respond_to do |format|
      if @dashboard.update(dashboard_params)
---
UPDATE "dashboards" SET "name" = 'Test2', "updated_at" = '2026-01-05 14:25:57.983684' WHERE "dashboards"."id" = 3

  def destroy
    @dashboard.destroy!
---
DELETE FROM "dashboards" WHERE "dashboards"."id" = 2

  def update_widget_positions
    positions = params[:positions] || []

    positions.each do |pos|
      widget = @dashboard.dashboard_widgets.find_by(id: pos[:id])
---
SELECT "dashboard_widgets".* FROM "dashboard_widgets" WHERE "dashboard_widgets"."dashboard_id" = 2
SELECT "dashboards".* FROM "dashboards" WHERE "dashboards"."id" = 1 LIMIT 1

    def set_dashboard
      @dashboard = Dashboard.find(params.expect(:id))
---
SELECT "dashboards".* FROM "dashboards" WHERE "dashboards"."id" = 1 LIMIT 1