app/controllers/data_sources_controller.rb

  def index
    @data_sources = DataSource.all
---
SELECT "data_sources".* FROM "data_sources"