app/controllers/user_groups_controller.rb

SELECT "user_groups".* FROM "user_groups"
---
  def index
    @user_groups = UserGroup.all