app/controllers/widgets_controller.rb

    def find_free_position(dashboard)
      columns = dashboard.columns || 12
      existing = dashboard.dashboard_widgets.pluck(:position_x, :position_y, :width, :height)

      # Suche von oben links nach unten rechts nach freiem Platz für 2x2 Widget
      (0..50).each do |y|
        (0..(columns - 2)).each do |x|
          fits = existing.none? do |ex_x, ex_y, ex_w, ex_h|
---
SELECT "widgets".* FROM "widgets"