app/models/data_source.rb

INSERT INTO "data_source_storages" ("created_at", "data_source_id", "stored_at", "updated_at", "value") VALUES ('2025-12-22 18:07:52.459552', 1, '2025-12-22 18:07:52.445756', '2025-12-22 18:07:52.459552', '{"userId":1,"id":1,"title":"sunt aut facere repellat provident occaecati excepturi optio reprehenderit","body":"quia et suscipit\nsuscipit recusandae consequuntur expedita et cum\nreprehenderit molestiae ut ut quas totam\nnostrum rerum est autem sunt rem eveniet architecto"}') RETURNING "id"
---
  def store_value(value, stored_at: Time.current)
    data_source_storages.create!(value: value, stored_at: stored_at)